IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/PRU_ICSSG0_PR1_ICSS_ECAP0_ECAP_SLV.xml
<module name="PRU_ICSSG0_PR1_ICSS_ECAP0_ECAP_SLV" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_TSCNT" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_TSCNT" offset="0x0" width="32" description="TIME STAMP COUNTER REGISTER">
		<bitfield id="TSCNT" width="32" begin="31" end="0" resetval="0x0" description="ACTIVE 32 BIT COUNTER REGISTER WHICH IS USED AS THE CAPTURE TIME-BASE " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CNTPHS" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CNTPHS" offset="0x4" width="32" description="COUNTER PHASE CONTROL REGISTER">
		<bitfield id="CNTPHS" width="32" begin="31" end="0" resetval="0x0" description="COUNTER PHASE VALUE REGISTER THAT CAN BE PROGRAMMED FOR PHASE LAG/LEAD THIS REGISTER SHADOWS TSCNT AND IS LOADED INTO TSCNT UPON EITHER A SYNCI EVENT OR S/W FORCE VIA A CONTROL BITUSED TO ACHIEVE PHASE CONTROL SYNC WITH RESPECT TO OTHER ECAP AND EPWM TIME-BASES " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP1" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP1" offset="0x8" width="32" description="CAPTURE-1 REGISTER">
		<bitfield id="CAP1" width="32" begin="31" end="0" resetval="0x0" description="THIS REGISTER CAN BE LOADED [WRITTEN] BY :TIME-STAMP [IE COUNTER VALUE] DURING A CAPTURE EVENTS/W MAY BE USEFUL FOR TEST PURPOSES / INITIALISATIONAPRD SHADOW REGISTER [IE CAP3] WHEN USED IN APWM MODE " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP2" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP2" offset="0xC" width="32" description="CAPTURE-2 REGISTER">
		<bitfield id="CAP2" width="32" begin="31" end="0" resetval="0x0" description="THIS REGISTER CAN BE LOADED [WRITTEN] BY :TIME-STAMP [IE COUNTER VALUE] DURING A CAPTURE EVENTS/W MAY BE USEFUL FOR TEST PURPOSESACMP SHADOW REGISTER [IE CAP4] WHEN USED IN APWM MODE " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP3" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP3" offset="0x10" width="32" description="CAPTURE-3  REGISTER">
		<bitfield id="CAP3" width="32" begin="31" end="0" resetval="0x0" description="IN CMP MODE THIS IS A TIME-STAMP CAPTURE REGISTERIN APMW MODE THIS IS THE PERIOD SHADOW [APER] REGISTER USER UPDATES THE PWM PERIOD VALUE VIA THIS REGISTER IN THIS MODE CAP3 [APRD] SHADOWS CAP1 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP4" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_CAP4" offset="0x14" width="32" description="CAPTURE-4  REGISTER">
		<bitfield id="CAP4" width="32" begin="31" end="0" resetval="0x0" description="IN CMP MODE THIS IS A TIME-STAMP CAPTURE REGISTERIN APMW MODE THIS IS THE COMPARE SHADOW [ACMP] REGISTER USER UPDATES THE PWM COMPARE VALUE VIA THIS REGISTER IN THIS MODE CAP4 [ACMP] SHADOWS CAP2 " range="31 - 0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_ECCTL2_ECCTL1" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_ECCTL2_ECCTL1" offset="0x28" width="32" description="ECAP CONTROL REGISTER 1">
		<bitfield id="FILTER" width="5" begin="31" end="27" resetval="0x0" description=" " range="31 - 27" rwaccess="R"/> 
		<bitfield id="APWMPOL" width="1" begin="26" end="26" resetval="0x0" description="APWM OUTPUT POLARITY SELECT:0OUTPUT IS ACTIVE HIGH [IE COMPARE VALUE DEFINES HIGH TIME]1OUTPUT IS ACTIVE LOW [IE COMPARE VALUE DEFINES LOW TIME]NOTE: THIS IS APPLICABLE ONLY IN APWM OPERATING MODE " range="26" rwaccess="R/W"/> 
		<bitfield id="CAP_APWM" width="1" begin="25" end="25" resetval="0x0" description="CAP/APWM OPERATING MODE SELECT:0ECAP MODULE OPERATES IN CAPTURE MODETHIS MODE FORCES THE FOLLOWING CONFIGURATION:1] INHIBITS TSCNT RESETS VIA PRD_EQ EVENT2] INHIBITS SHADOW LOADS ON CAP1 &#38;AMP" range="25" rwaccess="R/W"/> 
		<bitfield id="SWSYNC" width="1" begin="24" end="24" resetval="0x0" description="SOFTWARE FORCED COUNTER [TSCNT] SYNCING:0WRITING A ZERO HAS NO EFFECT WILL ALWAYS RETURN A ZERO1WRITING A ONE WILL FORCE A TSCNT SHADOW LOAD OF CURRENT ECAP MODULE AND ANY ECAP MODULES DOWN-STREAM PROVIDING THE SYNCO_SEL BITS ARE 0,0 AFTER WRITING A ONE THIS BIT RETURNS TO A ZERONOTE: THIS PROVIDES A CONVENIENT S/W METHOD TO SYNCHRONIZE SOME OR ALL ECAP TIMEBASES IN APWM MODE THE SYNCING CAN ALSO BE DONE VIA THE PRD_EQ EVENT " range="24" rwaccess="R/W"/> 
		<bitfield id="SYNCO_SEL" width="2" begin="23" end="22" resetval="0x0" description="SYNC-OUT SELECT:0,0SELECT SYNC-IN EVENT TO BE THE SYNC-OUT SIGNAL [PASS THROUGH]0,1SELECT PRD_EQ EVENT TO BE THE SYNC-OUT SIGNAL1,0DISABLE SYNC OUT SIGNAL1,1DISABLE SYNC OUT SIGNALNOTE: SELECTION PRD_EQ IS MEANINGFUL ONLY IN APWM MODE, HOWEVER CAN STILL BE CHOSEN IN CAP MODE IF USER BELIEVES IT TO BE USEFUL " range="23 - 22" rwaccess="R/W"/> 
		<bitfield id="SYNCI_EN" width="1" begin="21" end="21" resetval="0x0" description="COUNTER [TSCNT] SYNC-IN SELECT MODE:0DISABLE SYNC-IN OPTION1ENABLE COUNTER [TSCNT] TO BE LOADED FROM CNTPHS REGISTER UPON EITHER A SYNCI SIGNAL OR A S/W FORCE EVENT " range="21" rwaccess="R/W"/> 
		<bitfield id="TSCNTSTP" width="1" begin="20" end="20" resetval="0x0" description="COUNTER STOP [FREEZE] CONTROL:0COUNTER STOPPED1COUNTER FREE RUNNING " range="20" rwaccess="R/W"/> 
		<bitfield id="REARM_RESET" width="1" begin="19" end="19" resetval="0x0" description="ONE-SHOT RE-ARMING, IE WAIT FOR STOP TRIGGER:WRITING A ONE ARMS THE ONE-SHOT SEQUENCE, IE:1] RESETS THE MOD4 COUNTER TO ZERO2] UN-FREEZES THE MOD4 COUNTER3] ENABLES CAPTURE REGISTER LOADSWRITING A ZERO HAS NO EFFECT ALWAYS RETURNS A 0NOTE: THE RE-ARM FUNCTION IS VALID IN ONESHT OR CONTINOUS MODE " range="19" rwaccess="R/W"/> 
		<bitfield id="STOPVALUE" width="2" begin="18" end="17" resetval="0x3" description="STOP VALUE FOR ONE-SHOT MODE:THIS IS THE NUMBER [BETWEEN 1-4] OF CAPTURES ALLOWED TO OCCUR BEFORE THE CAP[1-4] REGISTERS ARE FROZEN, IECAPTURE SEQUENCE IS STOPPED0,0STOP AFTER CAPTURE EVENT 10,1STOP AFTER CAPTURE EVENT 21,0STOP AFTER CAPTURE EVENT 31,1STOP AFTER CAPTURE EVENT 4NOTES: [1] STOPVALUE IS COMPARED TO MOD4 COUNTER, WHEN EQUAL, 2 ACTIONS OCCUR:1] MOD4 COUNTER IS STOPPED [FROZEN]2] CAPTURE REGISTER LOADS ARE INHIBITED[2] IN ONE SHOT MODE, FURTHER INTERRUPT EVENTS ARE BLOCKED UNTIL WE RE-ARM, ONCE THE NUMBER OF EVENTS CAPTURED HAS BEEN REACHED " range="18 - 17" rwaccess="R/W"/> 
		<bitfield id="CONT_ONESHT" width="1" begin="16" end="16" resetval="0x0" description="CONTINUOUS OR ONESHOT MODE CONTROL:[APPLICABLE ONLY IN CAPTURE MODE]0OPERATE IN CONTINUOUS MODE1OPERATE IN ONE-SHOT MODE " range="16" rwaccess="R/W"/> 
		<bitfield id="FREE" width="1" begin="15" end="15" resetval="0x0" description="EMULATION CONTROL0,0 TSCNT COUNTER STOPS IMMEDIATELY ON EMULATION SUSPEND0,1 TSCNT COUNTER RUNS UNTIL = 01,X TSCNT COUNTER IS UNAFFECTED BY EMULATION SUSPEND [RUN FREE] " range="15" rwaccess="R/W"/> 
		<bitfield id="SOFT" width="1" begin="14" end="14" resetval="0x0" description="EMULATION CONTROL0,0 TSCNT COUNTER STOPS IMMEDIATELY ON EMULATION SUSPEND0,1 TSCNT COUNTER RUNS UNTIL = 01,X TSCNT COUNTER IS UNAFFECTED BY EMULATION SUSPEND [RUN FREE] " range="14" rwaccess="R/W"/> 
		<bitfield id="EVTFLTPS" width="5" begin="13" end="9" resetval="0x0" description="EVENT FILTER PRESCALE SELECT:0,0,0,0,0DIVIDE BY 1 [IE NO PRESCALE, BY-PASS THE PRESCALER]0,0,0,0,1DIVIDE BY 20,0,0,1,0DIVIDE BY 40,0,0,1,1DIVIDE BY 60,0,1,0,0DIVIDE BY 80,0,1,0,1DIVIDE BY 10    1,1,1,1,0DIVIDE BY 601,1,1,1,1DIVIDE BY 62 " range="13 - 9" rwaccess="R/W"/> 
		<bitfield id="CAPLDEN" width="1" begin="8" end="8" resetval="0x0" description="ENABLE LOADING OF CAP1-4 REGISTERS ON A CAPTURE EVENT:0DISABLE CAP1-4 REGISTER LOADS AT CAPTURE EVENT TIME1ENABLE CAP1-4 REGISTER LOADS AT CAPTURE EVENT TIME " range="8" rwaccess="R/W"/> 
		<bitfield id="CTRRST4" width="1" begin="7" end="7" resetval="0x0" description="COUNTER RESET ON CAPTURE EVENT 4:0DO NOT RESET COUNTER ON CAPTURE EVENT 4 [ABSOLUTE TIME STAMP]1RESET COUNTER AFTER EVENT 4 TIME-STAMP HAS BEEN CAPTURED[USED IN DIFFERENCE MODE OPERATION] " range="7" rwaccess="R/W"/> 
		<bitfield id="CAP4POL" width="1" begin="6" end="6" resetval="0x0" description="CAPTURE EVENT 4 POLARITY SELECT:0CAPTURE EVENT 4 TRIGGERED ON A RISING EDGE [FE]1CAPTURE EVENT 4 TRIGGERED ON A FALLING EDGE [FE] " range="6" rwaccess="R/W"/> 
		<bitfield id="CTRRST3" width="1" begin="5" end="5" resetval="0x0" description="COUNTER RESET ON CAPTURE EVENT 3:0DO NOT RESET COUNTER ON CAPTURE EVENT 3 [ABSOLUTE TIME STAMP]1RESET COUNTER AFTER EVENT 3 TIME-STAMP HAS BEEN CAPTURED[USED IN DIFFERENCE MODE OPERATION] " range="5" rwaccess="R/W"/> 
		<bitfield id="CAP3POL" width="1" begin="4" end="4" resetval="0x0" description="CAPTURE EVENT 3 POLARITY SELECT:0CAPTURE EVENT 3 TRIGGERED ON A RISING EDGE [FE]1CAPTURE EVENT 3 TRIGGERED ON A FALLING EDGE [FE] " range="4" rwaccess="R/W"/> 
		<bitfield id="CTRRST2" width="1" begin="3" end="3" resetval="0x0" description="COUNTER RESET ON CAPTURE EVENT 2:0DO NOT RESET COUNTER ON CAPTURE EVENT 2 [ABSOLUTE TIME STAMP]1RESET COUNTER AFTER EVENT 2 TIME-STAMP HAS BEEN CAPTURED[USED IN DIFFERENCE MODE OPERATION] " range="3" rwaccess="R/W"/> 
		<bitfield id="CAP2POL" width="1" begin="2" end="2" resetval="0x0" description="CAPTURE EVENT 2 POLARITY SELECT:0CAPTURE EVENT 2 TRIGGERED ON A RISING EDGE [FE]1CAPTURE EVENT 2 TRIGGERED ON A FALLING EDGE [FE] " range="2" rwaccess="R/W"/> 
		<bitfield id="CTRRST1" width="1" begin="1" end="1" resetval="0x0" description="COUNTER RESET ON CAPTURE EVENT 1:0DO NOT RESET COUNTER ON CAPTURE EVENT 1 [ABSOLUTE TIME STAMP]1RESET COUNTER AFTER EVENT 1 TIME-STAMP HAS BEEN CAPTURED[USED IN DIFFERENCE MODE OPERATION] " range="1" rwaccess="R/W"/> 
		<bitfield id="CAP1POL" width="1" begin="0" end="0" resetval="0x0" description="CAPTURE EVENT 1 POLARITY SELECT:0CAPTURE EVENT 1 TRIGGERED ON A RISING EDGE [FE]1CAPTURE EVENT 1 TRIGGERED ON A FALLING EDGE [FE] " range="0" rwaccess="R/W"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_ECFLG_ECEINT" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_ECFLG_ECEINT" offset="0x2C" width="32" description="ECAP INTERRUPT ENABLE REGISTER">
		<bitfield id="FLAG_RESV0" width="8" begin="31" end="24" resetval="0x0" description=" " range="31 - 24" rwaccess="R"/> 
		<bitfield id="FLAG_CMPEQ" width="1" begin="23" end="23" resetval="0x0" description="COMPARE EQUAL STATUS FLAG: READING A 1 ON THIS BIT INDICATES THE COUNTER [TSCNT] REACHED THE COMPARE REGISTER VALUE [ACMP]READING A 0 INDICATES NO EVENT OCCURREDNOTE: THIS FLAG IS ONLY ACTIVE IN APWM MODE " range="23" rwaccess="R"/> 
		<bitfield id="FLAG_PRDEQ" width="1" begin="22" end="22" resetval="0x0" description="PERIOD EQUAL STATUS FLAG: READING A 1 ON THIS BIT INDICATES THE COUNTER [TSCNT] REACHED THE PERIOD REGISTER VALUE [APER] AND WAS RESETREADING A 0 INDICATES NO EVENT OCCURREDNOTES: THIS FLAG IS ONLY ACTIVE IN APWM MODE " range="22" rwaccess="R"/> 
		<bitfield id="FLAG_CNTOVF" width="1" begin="21" end="21" resetval="0x0" description="COUNTER OVERFLOW STATUS FLAG: READING A 1 ON THIS BIT INDICATES THE COUNTER [TSCNT] HAS MADE THE TRANSITION FROM FFFFFFFF 00000000READING A 0 INDICATES NO EVENT OCCURREDNOTE: THIS FLAG IS ACTIVE IN CAP &#38;AMP" range="21" rwaccess="R"/> 
		<bitfield id="FLAG_CEVT4" width="1" begin="20" end="20" resetval="0x0" description="CAPTURE EVENT 4 STATUS FLAG: READING A 1 ON THIS BIT INDICATES THE FOURTH EVENT OCCURRED AT ECAPX PINREADING A 0 INDICATES NO EVENT OCCURREDNOTE: THIS FLAG IS ONLY ACTIVE IN CAP MODE " range="20" rwaccess="R"/> 
		<bitfield id="FLAG_CEVT3" width="1" begin="19" end="19" resetval="0x0" description="CAPTURE EVENT 3 STATUS FLAG: READING A 1 ON THIS BIT INDICATES THE THIRD EVENT OCCURRED AT ECAPX PINREADING A 0 INDICATES NO EVENT OCCURREDNOTE: THIS FLAG IS ONLY ACTIVE IN CAP MODE " range="19" rwaccess="R"/> 
		<bitfield id="FLAG_CEVT2" width="1" begin="18" end="18" resetval="0x0" description="CAPTURE EVENT 2 STATUS FLAG: READING A 1 ON THIS BIT INDICATES THE SECOND EVENT OCCURRED AT ECAPX PINREADING A 0 INDICATES NO EVENT OCCURREDNOTE: THIS FLAG IS ONLY ACTIVE IN CAP MODE " range="18" rwaccess="R"/> 
		<bitfield id="FLAG_CEVT1" width="1" begin="17" end="17" resetval="0x0" description="CAPTURE EVENT 1 STATUS FLAG: READING A 1 ON THIS BIT INDICATES THE FIRST EVENT OCCURRED AT ECAPX PINREADING A 0 INDICATES NO EVENT OCCURREDNOTE: THIS FLAG IS ONLY ACTIVE IN CAP MODE " range="17" rwaccess="R"/> 
		<bitfield id="FLAG_INT" width="1" begin="16" end="16" resetval="0x0" description="GLOBAL INTERRUPT STATUS FLAG: READING A 1 ON THIS BIT INDICATES THAT AN INTERRUPT WAS GENERATED FROM ONE OF THE FOLLOWING EVENTSREADING A 0 INDICATES NO INTERRUPT GENERATED " range="16" rwaccess="R"/> 
		<bitfield id="EN__RESV1" width="8" begin="15" end="8" resetval="0x0" description=" " range="15 - 8" rwaccess="R"/> 
		<bitfield id="EN_CMPEQ" width="1" begin="7" end="7" resetval="0x0" description="COMPARE EQUAL INTERRUPT ENABLE: 0DISABLED COMPARE EQUAL AS AN INTERRUPT SOURCE1ENABLE COMPARE EQUAL AS AN INTERRUPT SOURCE " range="7" rwaccess="R/W"/> 
		<bitfield id="EN_PRDEQ" width="1" begin="6" end="6" resetval="0x0" description="PERIOD EQUAL INTERRUPT ENABLE: 0DISABLED PERIOD EQUAL AS AN INTERRUPT SOURCE1ENABLE PERIOD EQUAL AS AN INTERRUPT SOURCE " range="6" rwaccess="R/W"/> 
		<bitfield id="EN_CNTOVF" width="1" begin="5" end="5" resetval="0x0" description="COUNTER OVERFLOW INTERRUPT ENABLE: 0DISABLED COUNTER OVERFLOW AS AN INTERRUPT SOURCE1ENABLE COUNTER OVERFLOW AS AN INTERRUPT SOURCE " range="5" rwaccess="R/W"/> 
		<bitfield id="EN_CEVT4" width="1" begin="4" end="4" resetval="0x0" description="CAPTURE EVENT 4 INTERRUPT ENABLE: 0DISABLED CAPTURE EVENT 1 AS AN INTERRUPT SOURCE1ENABLE CAPTURE EVENT 1 AS AN INTERRUPT SOURCE " range="4" rwaccess="R/W"/> 
		<bitfield id="EN_CEVT3" width="1" begin="3" end="3" resetval="0x0" description="CAPTURE EVENT 3 INTERRUPT ENABLE: 0DISABLED CAPTURE EVENT 1 AS AN INTERRUPT SOURCE1ENABLE CAPTURE EVENT 1 AS AN INTERRUPT SOURCE " range="3" rwaccess="R/W"/> 
		<bitfield id="EN_CEVT2" width="1" begin="2" end="2" resetval="0x0" description="CAPTURE EVENT 2 INTERRUPT ENABLE: 0DISABLED CAPTURE EVENT 1 AS AN INTERRUPT SOURCE1ENABLE CAPTURE EVENT 1 AS AN INTERRUPT SOURCE " range="2" rwaccess="R/W"/> 
		<bitfield id="EN_CEVT1" width="1" begin="1" end="1" resetval="0x0" description="CAPTURE EVENT 1 INTERRUPT ENABLE: 0DISABLED CAPTURE EVENT 1 AS AN INTERRUPT SOURCE1ENABLE CAPTURE EVENT 1 AS AN INTERRUPT SOURCE " range="1" rwaccess="R/W"/> 
		<bitfield id="EN_RESV0" width="1" begin="0" end="0" resetval="0x0" description=" " range="0" rwaccess="R"/>
	</register>
	<register id="PR1_ICSS_ECAP0__ECAP_SLV__REGS_PID" acronym="PR1_ICSS_ECAP0__ECAP_SLV__REGS_PID" offset="0x5C" width="32" description="ECAP PERIPHERAL ID REGISTER">
		<bitfield id="REVID" width="32" begin="31" end="0" resetval="0x1154621696" description="" range="31 - 0" rwaccess="R"/>
	</register>
</module>